In [1]:
import pandas as pd
import numpy as np

In [94]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["col1","col2","col3","col4"])

In [90]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [4]:
df.to_csv("Test1.csv")

In [5]:
#check is there any null records

df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [6]:
df.loc['row1'] # Get row1

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int64

In [7]:
df['col1']  # Get col1

row1     0
row2     4
row3     8
row4    12
row5    16
Name: col1, dtype: int64

In [91]:
df[ ['col1','col2'] ] # Get multiple cols

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [95]:
#Delete col4

del df['col4']

df

      col1  col2  col3
row1     0     1     2
row2     4     5     6
row3     8     9    10
row4    12    13    14
row5    16    17    18

In [9]:
type(df.loc['row1'])

pandas.core.series.Series

In [10]:
#Get count of each value
df.loc['row1'].value_counts()

3    1
2    1
1    1
0    1
Name: row1, dtype: int64

In [11]:
#Get unique value
df.loc['row1'].unique()

array([0, 1, 2, 3])

In [12]:
df.iloc[:,1:]

      col2  col3  col4
row1     1     2     3
row2     5     6     7
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [13]:
type(df.iloc[:,1:])

pandas.core.frame.DataFrame

In [14]:
#convert df to array

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [15]:
#Read CSV
df = pd.read_csv("mercedesbenz.csv")

In [16]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [18]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [19]:
df['X1'].value_counts()

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
f      23
y      23
j      22
n      19
k      17
p       9
g       6
d       3
q       3
ab      3
Name: X1, dtype: int64

# CSV

In [20]:
from io import StringIO, BytesIO

In [21]:
data=('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
     'c,d,3\n')

In [22]:
type(data)

str

In [23]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [24]:
df = pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [25]:
df.to_csv('test1.csv')

In [26]:
data=('a,b,c\n'
      '1,2,3\n'
      '4,5,6\n'
     '7,8,9\n')

In [27]:
pd.read_csv(StringIO(data))

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# Play with Datatypes

In [28]:
df = pd.read_csv(StringIO(data),dtype=object)

In [29]:
df['a']

0    1
1    4
2    7
Name: a, dtype: object

In [30]:
df = pd.read_csv(StringIO(data),dtype=int)

In [31]:
df['a']

0    1
1    4
2    7
Name: a, dtype: int64

In [32]:
df = pd.read_csv(StringIO(data),dtype=float)

In [33]:
df['a']

0    1.0
1    4.0
2    7.0
Name: a, dtype: float64

In [34]:
df = pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object})

In [35]:
df

   a    b  c
0  1  2.0  3
1  4  5.0  6
2  7  8.0  9

In [36]:
df.dtypes

a      int64
b    float64
c     object
dtype: object

In [37]:
df['a']

0    1
1    4
2    7
Name: a, dtype: int64

In [38]:
df['b']

0    2.0
1    5.0
2    8.0
Name: b, dtype: float64

In [39]:
df['c']

0    3
1    6
2    9
Name: c, dtype: object

# Play with Index

In [40]:
data=('index,a,b\n'
      '1,2,3\n'
      '4,5,6\n'
     '7,8,9\n')

In [41]:
df = pd.read_csv(StringIO(data))

In [42]:
df

   index  a  b
0      1  2  3
1      4  5  6
2      7  8  9

In [43]:
df = pd.read_csv(StringIO(data),index_col=0)

In [44]:
df

       a  b
index
1      2  3
4      5  6
7      8  9

In [45]:
df = pd.read_csv(StringIO(data),index_col=1)

In [46]:
df

   index  b
a
2      1  3
5      4  6
8      7  9

In [47]:
data=('index,a,b\n'
      '1,2,3,\n'
      '4,5,6,\n'
     '7,8,9,\n')

### index_col=false

In [48]:
df = pd.read_csv(StringIO(data))

In [49]:
df

   index  a   b
1      2  3 NaN
4      5  6 NaN
7      8  9 NaN

In [50]:
df = pd.read_csv(StringIO(data),index_col=False)

In [51]:
df

   index  a  b
0      1  2  3
1      4  5  6
2      7  8  9

In [52]:
df = pd.read_csv(StringIO(data),index_col=False,usecols=['b','index'])

In [53]:
df

   index  b
0      1  3
1      4  6
2      7  9

# Readig JSON

In [56]:
json = '{"name": "John", "age": 31, "city": "New York", "job_profile": [{"Position":"Team Leader","Department":"Data Science"}]}'

In [61]:
df = pd.read_json(json)

In [63]:
df.head()

   name  age      city                                        job_profile
0  John   31  New York  {'Position': 'Team Leader', 'Department': 'Dat...

In [66]:
#Convert JSON to CSV

df.to_csv('json.csv')

In [68]:
 #Read without Index
df.to_json(orient="records")

'[{"name":"John","age":31,"city":"New York","job_profile":{"Position":"Team Leader","Department":"Data Science"}}]'

In [67]:
#Reding with Index and value pair
df.to_json()

'{"name":{"0":"John"},"age":{"0":31},"city":{"0":"New York"},"job_profile":{"0":{"Position":"Team Leader","Department":"Data Science"}}}'

# Read HTML

In [70]:
df_html = pd.read_html("https://en.wikipedia.org/wiki/Mobile_country_code")

In [74]:
df_html[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test Network,Operational,any,NaN
1,1,1,TEST,Test Network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"

In [77]:
#Read specific table. Ex: Read table which has Brand column.

df_html1 = pd.read_html("https://en.wikipedia.org/wiki/Mobile_country_code",match="Brand",header=0)
df_html1[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test Network,Operational,any,NaN
1,1,1,TEST,Test Network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"

# Reading Excel File

In [111]:
df_excel = pd.read_excel("Excel_Sample.xlsx",index_col=0)

df_excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [113]:
#Reading Data from specific sheet

df_excel_sheet = pd.read_excel("Excel_Sample.xlsx",index_col=0,sheet_name="Sheet2")

df_excel_sheet

    e   f   g   h
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Pickling

#### Save your df/machine learning object to file

In [114]:
df_excle_sheet.to_pickle("df_excel_sheet")

NameError: name 'df_excle_sheet' is not defined